//============================================================
//
//	拡張子判定関数ヘッダー [extension.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _EXTENSION_H_
#define _EXTENSION_H_

//************************************************************
//	名前空間宣言
//************************************************************
// 拡張子判定空間
namespace extension
{
	// エイリアス定義
	using ALoad = std::vector<std::string>;	// 読み込む拡張子保存型

	// メンバ関数
	ALoad LoadExtension(const char* pFilePath);	// 読込可能拡張子の読込
	bool IsLoadOK(const ALoad& rLoadInfo, const char* pLoadFilePath);	// 読込可能フラグの取得
}

#endif	// _EXTENSION_H_
