//==========================================================
//
// サンプルタスク(リスト管理) [sample.cpp]
// Author : Ibuki Okusada
//
//==========================================================
#include "list_manager.h"
#include "manager_registry.h"

// マクロ定義

//==========================================================
// コンストラクタ
//==========================================================
CListManager::CListManager()
{
	// 値のクリア
	m_pNext = nullptr;
	m_pPrev = nullptr;

	CManagerRegistry::GetInstance()->ListIn(this);
}

//==========================================================
// デストラクタ
//==========================================================
CListManager::~CListManager()
{
	
}

//==========================================================
// 終了処理
//==========================================================
void CListManager::Uninit(void)
{
	CManagerRegistry::GetInstance()->ListOut(this);
}