//==========================================================
//
// サンプルタスク(リスト管理) [sample.cpp]
// Author : Ibuki Okusada
//
//==========================================================
#include "sample.h"
#include "sample_manager.h"

// マクロ定義

//==========================================================
// コンストラクタ
//==========================================================
CSample::CSample()
{
	// 値のクリア
	m_pNext = nullptr;
	m_pPrev = nullptr;

	CSampleManager::GetInstance()->ListIn(this);
}

//==========================================================
// デストラクタ
//==========================================================
CSample::~CSample()
{

}

//==========================================================
// 初期化処理
//==========================================================
HRESULT CSample::Init(void)
{
	return S_OK;
}

//==========================================================
// 終了処理
//==========================================================
void CSample::Uninit(void)
{
	CSampleManager::GetInstance()->ListOut(this);

	Release();
}

//==========================================================
// 更新処理
//==========================================================
void CSample::Update(void)
{

}

//==========================================================
// 生成
//==========================================================
CSample* CSample::Create(void)
{
	CSample* pSample = nullptr;

	pSample = new CSample;

	if (pSample != nullptr)
	{
		// 初期化処理
		pSample->Init();
	}

	return pSample;
}
